# Brewfile for macOS setup

# Fonts
cask "font-fira-mono-nerd-font"

# CLI tools - Modern replacements
brew "bat"              # cat replacement with syntax highlighting
brew "eza"              # ls replacement
brew "zoxide"           # cd replacement with smart directory jumping
brew "fd"               # find replacement
brew "ripgrep"          # grep replacement
brew "btop"             # top replacement
brew "fastfetch"        # neofetch replacement
brew "fzf"              # fuzzy finder
brew "jq"               # JSON processor

# Development tools
brew "uv"               # Python package installer
brew "ruff"             # Python linter
brew "direnv"           # Environment variable management
brew "tmux"             # Terminal multiplexer
brew "rust"
brew "starship"
# brew "pre-commit" # there is a problem with python version

# neovim related
brew "neovim"           # Text editor
brew "lazygit"          # mainly for lazyvim
brew "tree-sitter-cli"  # mainly for lazyvim

# Applications
cask "google-chrome"
cask "visual-studio-code"
cask "deepl"
cask "ghostty"
cask "grammarly-desktop"
cask "claude-code"
cask "docker-desktop"

# experimental / optional
cask "displaylink" # for multi screen
cask "codex"
cask "claude"
cask "chatgpt" # switch to just use atlas
